package offer.math;

/**
 ``````````````````````````````````题目描述```````````````````````````````````
 孩子们的游戏(圆圈中最后剩下的数)
 ````````````````````````````````````例子`````````````````````````````````````
 
 ````````````````````````````````````链接`````````````````````````````````````
 https://www.nowcoder.com/practice/f78a359491e64a50bce2d89cff857eb6?tpId=13&tqId=11199&tPage=1&rp=1&ru=/ta/coding-interviews&qru=/ta/coding-interviews/question-ranking
 ``````````````````````````````````解题思路```````````````````````````````````
 方法：约瑟夫环的问题。
 描述：
 ````````````````````````````````````思考`````````````````````````````````````
 n = 5
 m = 2
 1 2 3 4 5----------->有n个人,位置为2号位置
     3 4 5 1--------->有n-1个人，位置为0号位置
         5 1 3
             3 5
                3 最后剩下3

 n=5 m=4

 1 2 3 4 5------------>有n个人，位置为1号位置
         5 1 2 3------>有n-1个人。位置为2号位置
           5 1 2
             2 5
               2


 `````````````````````````````````````````````````````````````````````````````
 data：2019/4/8
 author:abiao
 `````````````````````````````````````````````````````````````````````````````
 * **/
public class LastRemaining {
    public int LastRemaining_Solution(int n, int m) {
        if(n == 0) return -1;
        if(n == 1) return 0;

        return (LastRemaining_Solution(n-1,m)+m) % n;
    }
}
