package offer.math;

/**
 ``````````````````````````````````题目描述```````````````````````````````````
 求出1~13的整数中1出现的次数,并算出100~1300的整数中1出现的次数？
 为此他特别数了一下1~13中包含1的数字有1、10、11、12、13因此共出现6次,但是对于后面问题他就没辙了。
 ACMer希望你们帮帮他,并把问题更加普遍化,可以很快的求出任意非负整数区间中1出现的次数（从1 到 n 中1出现的次数）。
 ````````````````````````````````````例子`````````````````````````````````````
 
 ````````````````````````````````````链接`````````````````````````````````````
 https://www.nowcoder.com/practice/bd7f978302044eee894445e244c7eee6?tpId=13&tqId=11184&tPage=1&rp=1&ru=/ta/coding-interviews&qru=/ta/coding-interviews/question-ranking
 ``````````````````````````````````解题思路```````````````````````````````````
 方法：计算个位出现1的数字的个数+十位出现数字1的个数+百位出现数字1的个数+......
 描述：如何计算某一位出现1的个数呢？

 比如：536
 1.个位会出现53次0-9的轮回。第54次就是0-6。每次轮实际上是回1出现的次数为1，所以各位出现1的个数为53+1
 2.十位会出现5次0-9的轮回。第6次是0-3。每次轮回1出现的次数为10，每次轮回实际上是增加了100（11,12,13....,19）。所以每次轮回十位为1的个数为10个。总共为5*10+10=60
 3.百位会出现0次轮回。第1次为0-5。每次轮回1出现的次数为100。每次轮回增加了1000(101,102,......199)。总共为100;
 总共为54+60+100
 ````````````````````````````````````思考`````````````````````````````````````
 
 `````````````````````````````````````````````````````````````````````````````
 data：2019/4/5
 author:abiao
 `````````````````````````````````````````````````````````````````````````````
 * **/
public class NumberOf1Between1AndN {
    public static int numberOf1Between1AndN(int n) {
        int count = 0;
        for(int i = 10; ; i *= 10){
            int a = n / i;
            int b = n % i;
            int m = i / 10;

            int p = a * m;//计算整个轮回的

            int q = (b / m) > 1 ? m : (b - m) >= 0 ? b-m+1 : 0;//计算没有一个轮回的。
            count += p+q;
            if(a == 0) break;
        }
        return count;
    }


    public static void main(String[] args){
        System.out.println(numberOf1Between1AndN(21));
    }
}
